core/app/Http/Controllers/ProductController.php

    public function productByCategory($slug)
    {
        $category = Category::where('slug', $slug)->firstOrFail();
---
select * from `categories` where `slug` = 'helth' and `categories`.`deleted_at` is null limit 1


            // Category list
            $categories = Route::is('product.by.category')
                ? Category::where('parent_id', $request->category_id)
                ->whereHas('products')
                ->orderBy('name')
                ->get()
---
select * from `categories` where `parent_id` = 164 and exists (select * from `products` inner join `products_categories` on `products`.`id` = `products_categories`.`product_id` where `categories`.`id` = `products_categories`.`category_id` and `products`.`deleted_at` is null) and `categories`.`deleted_at` is null order by `name` asc

        ->get();

        // Latest products (exclude current)
        $latestProducts = Product::where('id', '!=', $product->id)
            ->latest()
            ->take(3)
            ->get();
---
select * from `products` where `id` != 5251 and `products`.`deleted_at` is null order by `created_at` desc limit 3

    private function getOtherProducts($product, $limit = 6, $recentDays = 30)
    {
        $title = 'Similar Products';

        $query = Product::where('id', '!=', $product->id);

        if ($product->product_type_id) {
            $query->where('product_type_id', $product->product_type_id);
        } elseif ($product->categories) {
            $title = 'Related Products';

            $categoryIds = $product->categories->pluck('id');
            $leafCategoryIds = Category::whereIn('id', $categoryIds)
                ->whereNotIn('id', Category::pluck('parent_id')->filter())
                ->pluck('id');

            $query->whereHas('categories', function ($categoryQuery) use ($product, $leafCategoryIds) {
                $categoryQuery->whereIn('categories.id', $leafCategoryIds);
            });
        }

        $products = $query->with([
            'brand',
            'productVariants' => fn($q) => $q->published(),
        ])->withCount('reviews')
            ->take($limit)
            ->get();

        if ($products->isEmpty()) {
            $title = 'Latest Products';
            $products = Product::where('id', '!=', $product->id)
                ->where('created_at', '>=', now()->subDays($recentDays))
                ->latest()
                ->take($limit)
                ->get();
---
select `parent_id` from `categories` where `categories`.`deleted_at` is null
select * from `brands` where `brands`.`id` in (0, 1, 6, 11, 48) and `brands`.`deleted_at` is null
select * from `products` where `id` != 5178 and `created_at` >= '2026-03-20 13:57:55' and `products`.`deleted_at` is null order by `created_at` desc limit 6

    public function reviews(Request $request, $id)
    {
        $reviews   = ProductReview::with('user')->where('product_id', $id)->where('status', 'approve')->latest()->paginate(getPaginate(5));
---
select count(*) as aggregate from `product_reviews` where `product_id` = '5178' and `status` = 'approve' and `product_reviews`.`deleted_at` is null