core/app/Http/Controllers/Admin/AdminController.php

select count(*) as aggregate from `users`
select count(*) as aggregate from `users` where `profile_complete` = 1
---
        $widget['orders']['delivered_orders']  = ['color' => 'bg--success', 'count' => Order::isValidOrder()->delivered()->count(), 'route' => 'admin.order.delivered'];
        $widget['orders']['canceled_orders']   = ['color' => 'bg--danger', 'count' => Order::isValidOrder()->canceled()->count(), 'route' => 'admin.order.canceled'];

        $widget['total_users']             = User::count();
        $widget['active_users']            = User::active()->count();
        $widget['profile_completed']       = User::profileCompleted()->count();

select `browser`, `os`, `country` from `user_logins` where `created_at` >= '2026-03-10 17:33:51'
---


        // user Browsing, Country, Operating Log
        $userLoginData = UserLogin::where('created_at', '>=', Carbon::now()->subDays(30))->get(['browser', 'os', 'country']);

select * from `orders` where `orders`.`user_id` in (3, 4, 5, 6, 7, 8)
select * from `users` order by `id` desc limit 6
---
        $deposit = $deposits;

        $topSellingProducts    = Product::topSales(3);
        $latestUser            = User::with('orders')->orderBy('id', 'desc')->take(6)->get();

select SUM(qty_received * purchase_price) as total from `product_batches` where `purchased_at` between '2026-04-09 00:00:00' and '2026-04-09 23:59:59' limit 1
---
    private function getSummaryData($startDate, $endDate)
    {
        // Total Sales - Sum of completed orders (without shipping)
        $totalSales = Order::isValidOrder()
            ->whereBetween('created_at', [$startDate, $endDate])
            ->where('status', '!=', 'canceled')
            ->selectRaw('SUM(total_amount - shipping_charge) as total')
            ->first()
            ?->total ?? 0;

        // Total Shipping - Sum of all shipping charges from completed orders
        $totalShipping = Order::isValidOrder()
            ->whereBetween('created_at', [$startDate, $endDate])
            ->where('status', '!=', 'canceled')
            ->selectRaw('SUM(shipping_charge) as total')
            ->first()
            ?->total ?? 0;

        // Total Purchases - Sum of all product batch quantities * purchase price
        $totalPurchases = ProductBatch::whereBetween('purchased_at', [$startDate, $endDate])
            ->selectRaw('SUM(qty_received * purchase_price) as total')
            ->first()
            ?->total ?? 0;

select SUM((order_details.price - product_batches.purchase_price) * order_details.quantity) as total from `order_details` inner join `orders` on `order_details`.`order_id` = `orders`.`id` inner join `products` on `order_details`.`product_id` = `products`.`id` inner join `product_batches` on `products`.`id` = `product_batches`.`product_id` where `orders`.`created_at` between '2026-04-09 00:00:00' and '2026-04-09 23:59:59' and `orders`.`status` != 'canceled' limit 1
---

        // Calculate Total Profit from order_details.profit (already calculated at POS time)
        // This ensures accurate profit calculation using actual batch prices used at sale time
        $totalProfit = \DB::table('order_details')
            ->join('orders', 'order_details.order_id', '=', 'orders.id')
            ->whereBetween('orders.created_at', [$startDate, $endDate])
            ->where('orders.status', '!=', 'canceled')
            ->selectRaw('SUM(order_details.profit) as total')
            ->first()
            ?->total ?? 0;