core/app/Http/Controllers/Admin/MediaController.php

    public function mediaFiles()
    {
        $mediaFiles = Media::orderBy('id', 'desc')->paginate(33);
---
select * from `media` order by `id` desc limit 33 offset 0
select count(*) as aggregate from `media`