core/app/Http/Controllers/Admin/PermissionController.php

select * from `permissions` limit 25 offset 75
select count(*) as aggregate from `permissions`
---
    public function index()
    {
        $data['page_title'] = 'Permissions';
        $data['pageTitle'] = $data['page_title']; // ✅ Blade এর জন্য ঠিক
        $data['permissions'] = Permission::paginate(25);