core/app/Http/Controllers/Admin/PosController.php

select count(*) as aggregate from `products` where `products`.`deleted_at` is null
---
    public function getProducts(Request $request)
    {
        $page = (int) $request->query('page', 1);
        $perPage = (int) $request->query('per_page', 20);
        $offset = ($page - 1) * $perPage;

        // Get total count
        $totalProducts = Product::count();

select * from `brands` where `brands`.`id` in (0, 1, 8, 10, 12, 17, 30, 32, 36) and `brands`.`deleted_at` is null
---
    public function getProductById($id)
    {
        try {
            $product = Product::with('brand')->find($id);

insert into `orders` (`order_number`, `user_id`, `status`, `total_amount`, `payment_status`, `is_cod`, `updated_at`, `created_at`) values ('POS-1775718058', null, 3, 33.95, 1, 1, '2026-04-09 13:00:58', '2026-04-09 13:00:58')
---
            $customerId = session('pos_customer');

            // Create order (delivered by default)
            $order = Order::create([
                'order_number'   => 'POS-' . time(),
                'user_id'        => $customerId ?? null,
                'status'         => Status::ORDER_DELIVERED,
                'total_amount'   => $total,
                'payment_status' => Status::PAYMENT_SUCCESS,
                'is_cod'         => true,
            ]);

insert into `order_details` (`order_id`, `product_id`, `product_variant_id`, `quantity`, `price`, `discount`, `updated_at`, `created_at`) values (100, 3025, 0, 1, 35, 1.05, '2026-04-09 13:00:58', '2026-04-09 13:00:58')
select * from `products` where `products`.`id` = 3025 and `products`.`deleted_at` is null limit 1
update `products` set `in_stock` = 309, `products`.`updated_at` = '2026-04-09 13:00:58' where `id` = 3025
insert into `orders` (`order_number`, `user_id`, `status`, `total_amount`, `cost_amount`, `profit`, `payment_status`, `is_cod`, `updated_at`, `created_at`) values ('POS-1775736273', null, 3, 1200, 0, 0, 1, 1, '2026-04-09 18:04:33', '2026-04-09 18:04:33')
---
                $itemSubtotal = $unitPrice * $item['quantity'];
                $itemDiscount = ($itemSubtotal / $subtotal) * $actualDiscount;

                OrderDetail::create([
                    'order_id'           => $order->id,
                    'product_id'         => $productId,
                    'product_variant_id' => 0,
                    'quantity'           => $item['quantity'],
                    'price'              => $unitPrice,
                    'discount'           => round($itemDiscount, 2),
                ]);

                // adjust stock if product tracks inventory
                try {
                    $product = Product::find($productId);
                    if ($product && $product->track_inventory) {
                        $product->in_stock = max(0, $product->in_stock - $item['quantity']);
                        $product->save();

                        $description = "Sold $item[quantity] " . Str::plural('product', $item['quantity']) . " (POS)";
                        $productManager = new ProductManager();
                        $productManager->createStockLog($product, $item['quantity'], $description, null, '-', $order->id);

insert into `deposits` (`user_id`, `order_id`, `amount`, `method_code`, `method_currency`, `trx`, `status`, `updated_at`, `created_at`) values (null, 100, 33.95, 0, 'TK', 'POS-100-1775718058', 1, '2026-04-09 13:00:58', '2026-04-09 13:00:58')
---
                $deposit->method_currency = gs('cur_text');
                $deposit->trx = 'POS-' . $order->id . '-' . time();
                $deposit->status = Status::PAYMENT_SUCCESS;
                $deposit->save();