core/app/Http/Controllers/Admin/PosController.php

    public function getProducts(Request $request)
    {
        $page = (int) $request->query('page', 1);
        $perPage = (int) $request->query('per_page', 20);
        $offset = ($page - 1) * $perPage;

        // Get total count
        $totalProducts = Product::count();
---
select count(*) as aggregate from `products` where `products`.`deleted_at` is null

    public function getProductById($id)
    {
        try {
            $product = Product::with('brand')->find($id);
---
select * from `brands` where `brands`.`id` in (0, 1, 2, 3, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 17, 18, 19, 25, 27, 29, 31, 34, 35, 37, 38, 58, 61) and `brands`.`deleted_at` is null