core/app/Http/Controllers/Admin/ProductController.php

select * from `products` where `products`.`id` = '5251' and `products`.`deleted_at` is null limit 1
select * from `purchasers` where `purchasers`.`id` in (1)
select `attribute_values`.*, `attribute_value_product`.`product_id` as `pivot_product_id`, `attribute_value_product`.`attribute_value_id` as `pivot_attribute_value_id`, `attribute_value_product`.`media_id` as `pivot_media_id` from `attribute_values` inner join `attribute_value_product` on `attribute_values`.`id` = `attribute_value_product`.`attribute_value_id` where `attribute_value_product`.`product_id` in (5251)
select `attributes`.*, `attribute_product`.`product_id` as `pivot_product_id`, `attribute_product`.`attribute_id` as `pivot_attribute_id` from `attributes` inner join `attribute_product` on `attributes`.`id` = `attribute_product`.`attribute_id` where `attribute_product`.`product_id` in (5251)
---
    public function edit($id)
    {
        $product = Product::with(['attributes', 'attributeValues.media', 'batches.purchaser',])->findOrFail($id);

select * from `brands` where `brands`.`deleted_at` is null order by `name` asc
select * from `categories` where `parent_id` is null and `categories`.`deleted_at` is null
select * from `attributes`
select * from `purchasers` order by `name` asc
select `attribute_values`.*, `attribute_value_product`.`product_id` as `pivot_product_id`, `attribute_value_product`.`attribute_value_id` as `pivot_attribute_value_id`, `attribute_value_product`.`media_id` as `pivot_media_id` from `attribute_values` inner join `attribute_value_product` on `attribute_values`.`id` = `attribute_value_product`.`attribute_value_id` where `attribute_value_product`.`product_id` in (5262)
select `attributes`.*, `attribute_product`.`product_id` as `pivot_product_id`, `attribute_product`.`attribute_id` as `pivot_attribute_id` from `attributes` inner join `attribute_product` on `attributes`.`id` = `attribute_product`.`attribute_id` where `attribute_product`.`product_id` in (5262)
---
    public function productForm($pageTitle, $product = null)
    {



        $brands                 = Brand::orderBy('name')->get();
        $categories             = Category::with('allSubcategories')->isParent()->get();
        $attributes             = Attribute::with('attributeValues')->get();
        $purchasers    = Purchaser::orderBy('name')->get();
        $productAttributes      = [];
        $attributeValues        = [];

        if ($product && $product->attributes->count()) {
            $productAttributes  = $product->attributes->pluck('id');
            $attributeValues    = $product->attributeValues->groupBy('attribute_id');
            $attributeValues    = $attributeValues->map->pluck('pivot.attribute_value_id')->all();

select * from `products` where `products`.`id` = '5251' and `products`.`deleted_at` is null limit 1
---
    public function store(Request $request, $id = 0)
    {
        $productManager    = $this->productManager;
        $isUpdate          = $id ? true : false;

        if ($isUpdate) {
            $product = Product::find($id);

update `products` set `barcode_path` = 'barcodes/products/GL4W5-166.png', `products`.`updated_at` = '2026-04-09 23:42:00' where `id` = 5184
---
                $product->sku,
                'barcodes/products'
            );
            $product->saveQuietly();