core/app/Http/Controllers/Admin/ProductStockController.php

select * from `purchasers` order by `name` asc
---
    public function addStock()
    {
        $pageTitle = 'Add Stock';
        $purchasers = Purchaser::orderBy('name')->get();

select * from `purchasers` where `purchasers`.`id` = '27' limit 1
---
            }

            // Validate purchaser exists
            $purchaser = Purchaser::find($purchaserId);

select * from `products` where `products`.`id` = 5184 and `products`.`deleted_at` is null limit 1
---
                    ], 422);
                }

                $product = Product::find($item['id']);

select `id`, `name` from `purchasers` where `purchasers`.`id` in (1, 25, 27)
select batch_no, purchaser_id, SUM(qty_received) as total_qty_received, COUNT(DISTINCT product_id) as product_count, MAX(id) as id, MAX(purchased_at) as purchased_at, SUM(qty_received * purchase_price) as total_purchase_amount from `product_batches` group by `batch_no`, `purchaser_id` order by `purchased_at` desc limit 20 offset 0
select * from `purchasers` order by `name` asc
---
    public function purchasesList(Request $request)
    {
        $query = ProductBatch::selectRaw('batch_no, purchaser_id, SUM(qty_received) as total_qty_received, COUNT(DISTINCT product_id) as product_count, MAX(id) as id, MAX(purchased_at) as purchased_at, SUM(qty_received * purchase_price) as total_purchase_amount')
            ->with(['purchaser:id,name'])
            ->groupBy('batch_no', 'purchaser_id')
            ->orderBy('purchased_at', 'desc');

        // Search by batch number or product name
        if ($request->has('q') && $request->input('q')) {
            $searchTerm = $request->input('q');
            $query->where('batch_no', 'like', "%{$searchTerm}%");
        }

        // Filter by purchaser if provided
        if ($request->has('purchaser_id') && $request->input('purchaser_id')) {
            $query->where('purchaser_id', $request->input('purchaser_id'));
        }

        // Filter by date range if provided
        if ($request->has('date_from') && $request->input('date_from')) {
            $query->whereDate('purchased_at', '>=', $request->input('date_from'));
        }

        if ($request->has('date_to') && $request->input('date_to')) {
            $query->whereDate('purchased_at', '<=', $request->input('date_to'));
        }

        $purchases = $query->paginate(getPaginate());
        $pageTitle = 'Stock Purchase List';

        // Get purchasers for filter dropdown
        $purchasers = Purchaser::orderBy('name')->get();