core/app/Http/Controllers/Admin/ProductListController.php

select * from `brands` where `brands`.`id` in (0, 1, 8, 10, 12, 17, 22, 30, 32, 34, 36) and `brands`.`deleted_at` is null
select * from `product_variants` where `product_variants`.`product_id` in (5158, 5159, 5160, 5161, 5162, 5163, 5164, 5165, 5166, 5167, 5168, 5169, 5170, 5171, 5172, 5173, 5174, 5178, 5181, 5183) and `product_variants`.`deleted_at` is null
select * from `products` where (`name` LIKE '%Napa Extra 500mg%' or `slug` LIKE '%Napa Extra 500mg%') and `products`.`deleted_at` is null order by `id` desc limit 20 offset 0
select `categories`.*, `products_categories`.`product_id` as `pivot_product_id`, `products_categories`.`category_id` as `pivot_category_id` from `categories` inner join `products_categories` on `categories`.`id` = `products_categories`.`category_id` where `products_categories`.`product_id` in (5158, 5159, 5160, 5161, 5162, 5163, 5164, 5165, 5166, 5167, 5168, 5169, 5170, 5171, 5172, 5173, 5174, 5178, 5181, 5183) and `categories`.`deleted_at` is null
---
    public function index()
    {
        $pageTitle = "All Products";
        $trashed   = false;
        $products  = Product::searchable(['name', 'slug'])
            ->filter(['is_published', 'brand_id', 'is_showable', 'is_downloadable', 'product_type_id', 'product_type', 'is_published']);


        if (request()->has('category')) {
            $products = $products->whereHas('categories', function ($query) {
                $query->where('categories.id', request()->category);
            });
        }

        if (request()->sort_by) {
            if (request()->sort_by == 'price_htl') {
                $products->orderBy('regular_price', 'DESC');
            } else if (request()->sort_by == 'price_lth') {
                $products->orderBy('regular_price', 'ASC');
            } else if (request()->sort_by == 'oldest') {
                $products->orderBy('id', 'ASC');
            } else if (request()->sort_by == 'latest') {
                $products->orderBy('id', 'DESC');
            }
        } else {
            $products->orderBy('id', 'desc');
        }

        $products = $products->with(['categories', 'brand', 'productVariants'])->paginate(getPaginate());