core/app/Http/Controllers/Admin/ProductController.php

select * from `brands` where `brands`.`deleted_at` is null order by `name` asc
select * from `categories` where `parent_id` is null and `categories`.`deleted_at` is null
select * from `attributes`
select * from `purchasers` order by `name` asc
---
    public function productForm($pageTitle, $product = null)
    {



        $brands                 = Brand::orderBy('name')->get();
        $categories             = Category::with('allSubcategories')->isParent()->get();
        $attributes             = Attribute::with('attributeValues')->get();
        $purchasers    = Purchaser::orderBy('name')->get();