core/app/Http/Helpers/helpers.php

select * from `extensions` where `act` = 'google-analytics' and `status` = 1 limit 1
---
function loadExtension($key)
{
    $extension = Extension::where('act', $key)->where('status', Status::ENABLE)->first();

select * from `frontends` where `tempname` = 'basic' and `data_keys` = 'footer.content' order by `id` desc limit 1
select * from `frontends` where `tempname` = 'basic' and `data_keys` = 'social_icon.element' order by `id` asc
select * from `frontends` where `tempname` = 'basic' and `data_keys` = 'banner.element' order by `id` desc
---
function getContent($dataKeys, $singleQuery = false, $limit = null, $orderById = false)
{

    $templateName = activeTemplateName();
    if ($singleQuery) {
        $content = Frontend::where('tempname', $templateName)->where('data_keys', $dataKeys)->orderBy('id', 'desc')->first();
    } else {
        $article = Frontend::where('tempname', $templateName);
        $article->when($limit != null, function ($q) use ($limit) {
            return $q->limit($limit);
        });
        if ($orderById) {
            $content = $article->where('data_keys', $dataKeys)->orderBy('id')->get();
        } else {
            $content = $article->where('data_keys', $dataKeys)->orderBy('id', 'desc')->get();