core/app/Support/Sku.php

select exists(select * from `products` where `sku` = 'GL4W5-166' and `products`.`deleted_at` is null) as `exists`
---
    public static function base(): string
    {
        do {
            $sku = strtoupper(Str::random(5)).'-'.rand(100,999);
        } while (Product::where('sku', $sku)->exists());