core/app/Lib/ProductManager.php

    public function createStockLog($product, $changeQuantity, $description = '', $variant = null, $remark = null, $orderId = null)
    {
        if ($changeQuantity != 0) {
            $log                     = new StockLog();
            $log->product_id         = $product->id;
            $log->product_variant_id = $variant ? $variant->id : 0;
            $log->order_id           = $orderId;
            $log->change_quantity    = abs($changeQuantity);
            $log->post_quantity      = $variant->in_stock ?? $product->in_stock;
            $log->description        = $description;
            $log->remark             = $remark;
            $log->save();
---
insert into `stock_logs` (`product_id`, `product_variant_id`, `order_id`, `change_quantity`, `post_quantity`, `description`, `remark`, `updated_at`, `created_at`) values (3025, 0, 100, 1, 309, 'Sold 1 product (POS)', '-', '2026-04-09 13:00:58', '2026-04-09 13:00:58')

        $product->product_type_id           = $request->product_type_id ?? 0;
        $product->specification             = $request->specification ?? null;

        $product->save();
---
insert into `products` (`name`, `slug`, `product_type`, `brand_id`, `regular_price`, `sale_price`, `wholesale_price`, `sale_starts_from`, `sale_ends_at`, `description`, `summary`, `meta_title`, `meta_description`, `meta_keywords`, `main_image_id`, `video_link`, `extra_descriptions`, `is_published`, `is_showable`, `is_downloadable`, `delivery_type`, `sku`, `track_inventory`, `show_stock`, `in_stock`, `alert_quantity`, `product_type_id`, `specification`, `updated_at`, `created_at`) values ('testing', 'testing', '1', 0, '10', '8', '7', null, null, null, null, null, null, null, 0, null, null, 1, 1, 0, null, 'GL4W5-166', 0, 0, 0, 0, 0, null, '2026-04-09 23:41:58', '2026-04-09 23:41:58')

    public function receiveStock(Product $product, ?ProductVariant $variant, array $data): ProductBatch
    {
        Log::debug('receiveStock called', $data);
        $batch = ProductBatch::firstOrCreate(
            [
                'product_id' => $product->id,
                'variant_id' => $variant->id ?? null,
                'batch_no'   => $data['batch_no'],
            ],
            [
                'purchaser_id'   => $data['purchaser_id'],
                'purchase_price' => $data['purchase_price'] ?? null,
                'purchased_at'   => $data['purchased_at'] ?? now(),
            ]
        );
---
insert into `product_batches` (`product_id`, `variant_id`, `batch_no`, `purchaser_id`, `purchase_price`, `purchased_at`, `updated_at`, `created_at`) values (5183, null, '11223344', '25', 10, '2026-04-09', '2026-04-09 14:36:18', '2026-04-09 14:36:18')
select * from `product_batches` where (`product_id` = 5183 and `variant_id` is null and `batch_no` = '11223344') limit 1