core/app/Lib/StockManager.php

    public static function deductStock(Product $product, int $quantity, array $options = []): array
    {
        if ($quantity <= 0) {
            return [
                'success' => false,
                'message' => 'Invalid quantity: must be greater than 0',
                'deducted' => 0
            ];
        }

        try {
            return DB::transaction(function () use ($product, $quantity, $options) {
                $batchId = $options['batch_id'] ?? null;
                $orderId = $options['order_id'] ?? null;
                $description = $options['description'] ?? "Product sold (qty: {$quantity})";
                $variant = $options['variant'] ?? null;

                // 1. Deduct from product in_stock (main table)
                $originalStock = $product->in_stock ?? 0;
                $newStock = max(0, $originalStock - $quantity);

                $product->update(['in_stock' => $newStock]);
---
update `products` set `in_stock` = 70, `products`.`updated_at` = '2026-04-12 15:40:47' where `id` = 3025


                // 2. Update ProductBatch qty_sold (if batch specified)
                if ($batchId) {
                    $updateResult = ProductBatch::where('id', $batchId)->increment('qty_sold', $quantity);
---
update `product_batches` set `qty_sold` = `qty_sold` + 10, `product_batches`.`updated_at` = '2026-04-12 15:40:47' where `id` = 2492

                    $stockLog->post_quantity = $product->in_stock;
                    $stockLog->description = $description;
                    $stockLog->remark = '-'; // minus/deduction
                    $stockLog->save();
---
insert into `stock_logs` (`product_id`, `product_variant_id`, `order_id`, `batch_id`, `change_quantity`, `post_quantity`, `description`, `remark`, `updated_at`, `created_at`) values (3025, 0, 6, '2492', 10, 70, 'POS Sale - Qty: 10 (Batch ID: 2492)', '-', '2026-04-12 15:40:47', '2026-04-12 15:40:47')